tap "antoniorodr/memo"
tap "steipete/tap"
brew "gettext"
brew "python@3.14"
brew "asciidoc"
brew "autoconf"
brew "colima", restart_service: :changed
brew "colordiff"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "ffmpeg"
brew "gemini-cli"
brew "gh"
brew "go"
brew "himalaya"
brew "htop"
brew "mysql-client"
brew "nmap"
brew "python@3.13", link: false
brew "shellcheck"
brew "uv"
brew "wget"
brew "yt-dlp"
brew "steipete/tap/camsnap"
brew "steipete/tap/gogcli"
brew "steipete/tap/imsg"
brew "steipete/tap/peekaboo"
brew "steipete/tap/remindctl"
brew "steipete/tap/sag"
brew "steipete/tap/songsee"
brew "steipete/tap/summarize"
brew "steipete/tap/wacli"
cask "1password-cli"
cask "macfuse"
vscode "aaron-bond.better-comments"
vscode "adrianwilczynski.toggle-hidden"
vscode "analytic-signal.preview-mp4"
vscode "analytic-signal.preview-pdf"
vscode "anthropic.claude-code"
vscode "bierner.markdown-yaml-preamble"
vscode "codezombiech.gitignore"
vscode "ctc.vscode-tree-extension"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-highlight"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.code-runner"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "grafana.grafana-vscode"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "jebbs.markdown-extended"
vscode "limelights.vscode-tag-files"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-github-issue-notebooks"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-sqlite"
vscode "naumovs.color-highlight"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "rafaelmaiolla.diff"
vscode "remisa.shellman"
vscode "saeris.markdown-github-alerts"
vscode "sukumo28.wav-preview"
vscode "tamasfe.even-better-toml"
vscode "tbutterwith.bosun"
vscode "timonwong.shellcheck"
vscode "waderyan.gitblame"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
