brew "gettext"
brew "python@3.14"
brew "asciidoc"
brew "autoconf"
brew "colima"
brew "colordiff"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "ffmpeg"
brew "htop"
brew "mysql-client"
brew "nmap"
brew "shellcheck"
brew "uv"
brew "wget"
brew "yt-dlp"
cask "macfuse"
vscode "aaron-bond.better-comments"
vscode "adrianwilczynski.toggle-hidden"
vscode "analytic-signal.preview-mp4"
vscode "analytic-signal.preview-pdf"
vscode "anthropic.claude-code"
vscode "bierner.markdown-yaml-preamble"
vscode "codezombiech.gitignore"
vscode "ctc.vscode-tree-extension"
vscode "darkriszty.markdown-table-prettify"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-highlight"
vscode "fabiospampinato.vscode-todo-plus"
vscode "formulahendry.code-runner"
vscode "gera2ld.markmap-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "grafana.grafana-vscode"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "jebbs.markdown-extended"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.datawrangler"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-sqlite"
vscode "naumovs.color-highlight"
vscode "peterschmalfeldt.explorer-exclude"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "rafaelmaiolla.diff"
vscode "remisa.shellman"
vscode "saeris.markdown-github-alerts"
vscode "sukumo28.wav-preview"
vscode "tamasfe.even-better-toml"
vscode "tbutterwith.bosun"
vscode "timonwong.shellcheck"
vscode "waderyan.gitblame"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/perf/cmd/benchstat"
go "github.com/bizshuk/cmd/cleanfilename"
go "github.com/spf13/cobra/cobra"
go "github.com/spf13/cobra-cli"
go "github.com/bizshuk/crawler"
go "github.com/go-delve/delve/cmd/dlv"
go "employee.com"
go "github.com/bizshuk/cmd/fileop"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/ramya-rao-a/go-outline"
go "github.com/acroca/go-symbols"
go "github.com/mdempsky/gocode"
go "github.com/stamblerre/gocode"
go "github.com/rogpeppe/godef"
go "github.com/godoctor/godoctor"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/sqs/goreturns"
go "github.com/jstemmer/gotags"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/bizshuk/gosdk/cmd/stringer"
go "sample.shuk/tools_dev"
