brew "gettext"
brew "python@3.14"
brew "asciidoc"
brew "autoconf"
brew "colima"
brew "colordiff"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "ffmpeg"
brew "gh"
brew "htop"
brew "mysql-client"
brew "nmap"
brew "shellcheck"
brew "uv"
brew "wget"
brew "yt-dlp"
cask "macfuse"
